app/views/students/welcome.html.erb

										  <button type="button" class="btn btn-success btn-sm btn-block" >
												Total Test is <%= current_student.standard.tests.count%>
---
SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "tests".* FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" INNER JOIN "standard_subjects" ON "tests"."standard_subject_id" = "standard_subjects"."id" WHERE "standard_subjects"."standard_id" = $1 AND "results"."student_id" = $2  [["standard_id", 5], ["student_id", 7]]
SELECT COUNT(*) FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" INNER JOIN "standard_subjects" ON "tests"."standard_subject_id" = "standard_subjects"."id" WHERE "standard_subjects"."standard_id" = $1 AND "results"."student_id" = $2  [["standard_id", 5], ["student_id", 7]]

															<td>Questions <span class="badge"><%= test.no_of_questions %></span></td>
															<td><%= test.teacher.first_name %></td>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]