app/views/teachers/assign.html.erb

SELECT "standards".* FROM "standards"
---

								<%= select_tag 'standard_id', options_from_collection_for_select(Standard.all, 'id', 'name'), {class: "form-control"} %>

SELECT "subjects".* FROM "subjects"
---
							<div class="col-sm-8">
								<%=select_tag 'subject_id',	options_from_collection_for_select(Subject.all, 'id', 'sub_name'), {class: "form-control"}%>

SELECT "teacher_standard_subjects".* FROM "teacher_standard_subjects" WHERE "teacher_standard_subjects"."teacher_id" = $1  [["teacher_id", 1]]
---
					<tbody>
						<% @teacher.teacher_standard_subjects.each do |tea_std_sub| %>