app/views/teachers/new.html.erb

SELECT "subjects"."sub_name" FROM "subjects"
---
                            <div class="col-sm-8">
                              <%=f.select(:sub_name,options_for_select(Subject.pluck(:sub_name)),{},{class: "form-control"})%>