app/views/teachers/search.html.erb

						<div class="col-sm-4">
							<%= select_tag 'standard_id', options_from_collection_for_select(Standard.all, 'id', 'name'), {class: "form-control"} %>
---
SELECT "standards".* FROM "standards"

						<div class="col-sm-4">
							<%=select_tag 'subject_id',	options_from_collection_for_select(Subject.all, 'id', 'sub_name'), {class: "form-control"}%>
---
SELECT "subjects".* FROM "subjects"