app/views/teachers/welcome.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 7]]
---
  <%
  stu_1=Student.find(7).first_name

SELECT DISTINCT "tests".* FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" WHERE "tests"."teacher_id" = $1  [["teacher_id", 1]]
---
          <tbody>
            <% current_teacher.tests.joins(:results).distinct.each do |test| %>

SELECT COUNT(*) FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" WHERE "tests"."id" = $1  [["id", 1]]
---
            <td><%=test.test_name  %></td>
              <td><%= Test.where(:id=>test.id).joins(:results).count%></td>

SELECT DISTINCT COUNT(DISTINCT student_id) AS count_student_id, test_name AS test_name FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" WHERE "tests"."teacher_id" = $1 GROUP BY "tests"."test_name"  [["teacher_id", 1]]
---
     <h2> how many student attend the test</h2>
<% g_data=current_teacher.tests.joins(:results).distinct.group(:test_name).count(:student_id) %>

SELECT AVG("results"."percentage") AS average_percentage, first_name AS first_name, student_id AS student_id FROM "results" INNER JOIN "students" ON "students"."id" = "results"."student_id" GROUP BY "first_name", "results"."student_id"
---
          <tbody>
            <% Result.joins(:student).select(:first_name).group(:first_name,:student_id).average(:percentage).each do |k,v| %>

SELECT AVG("results"."percentage") AS average_percentage, student_id AS student_id FROM "results" GROUP BY "results"."student_id"
---
     <h1> all student result average </h1>
<%data1=Result.group(:student_id).average(:percentage)%>