app/controllers/students/sessions_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."email" IS NULL LIMIT 1
---
def create
  super
  student = Student.find_by_email(params[:email])