app/controllers/questions_controller.rb

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", 6]]
---
  def set_test
    @test_id = Test.find(params[:test_id])