app/controllers/students_controller.rb

SELECT "tests".* FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" INNER JOIN "standard_subjects" ON "tests"."standard_subject_id" = "standard_subjects"."id" WHERE "standard_subjects"."standard_id" = $1 AND "results"."student_id" = $2  [["standard_id", 5], ["student_id", 7]]
SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "results".* FROM "results" WHERE "results"."test_id" = $1 AND "results"."student_id" = $2  [["test_id", 4], ["student_id", 7]]
SELECT "tests".* FROM "tests" INNER JOIN "results" ON "results"."test_id" = "tests"."id" INNER JOIN "standard_subjects" ON "tests"."standard_subject_id" = "standard_subjects"."id" WHERE "standard_subjects"."standard_id" = $1 AND "results"."student_id" = $2  ORDER BY "tests"."test_datetime" DESC  [["standard_id", 5], ["student_id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1  ORDER BY "students"."id" ASC LIMIT 1  [["id", 7]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", 6]]
---
  def welcome
    @results=nil;
     @avatar_path=("/avatars/students/originals/"+current_student.avatar_file_name)
    @complete_tests=current_student.standard.tests.joins(:results).where(:results =>{student_id:current_student.id})

    @upcoming_tests=current_student.standard.tests.where('test_datetime >= ?',DateTime.now)
    @not_attended_tests=current_student.standard.tests.reject {|test| test.results.where(student_id:current_student.id).present? == (test.test_datetime<DateTime.now)}

SELECT  "results".* FROM "results" WHERE "results"."student_id" = $1 AND "results"."test_id" = $2 LIMIT 1  [["student_id", 7], ["test_id", 6]]
---
  def resultdata
    @st=Result.find_by(:student_id=>current_student.id,:test_id=>params[:t_id])

SELECT  "students".* FROM "students" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "students"
SELECT  "standards".* FROM "standards"  ORDER BY "standards"."id" ASC LIMIT 1
SELECT  "students".* FROM "students" WHERE "students"."standard_id" = $1 LIMIT 10 OFFSET 0  [["standard_id", 2]]
SELECT COUNT(*) FROM "students" WHERE "students"."standard_id" = $1  [["standard_id", 5]]
---
  def list
  if params[:query].blank?
    @students=Student.paginate(:per_page => 5, :page => params[:page])
  else
    @students = Student.search_by_standard_name(params[:query]).paginate(:per_page => 5, :page => params[:page])

SELECT  "students".* FROM "students" WHERE "students"."id" = $1  ORDER BY "students"."id" ASC LIMIT 1  [["id", 7]]
---
  def set_student
    @student = Student.find(params[:id])