app/controllers/students_controller.rb

SELECT "tests"."test_datetime" FROM "tests"  ORDER BY "tests"."test_datetime" DESC
---
  def welcome
    @tests=current_student.standard.tests.order(:test_datetime)