app/controllers/teachers_controller.rb

  def list
    if params[:query].blank?
    @teachers=Teacher.paginate(:per_page => 5, :page => params[:page])
---
SELECT  "teachers".* FROM "teachers" LIMIT 5 OFFSET 0

  def update
    if @teacher.update(teacher_params)
---
UPDATE "teachers" SET "encrypted_password" = $1, "gender" = $2, "updated_at" = $3 WHERE "teachers"."id" = $4  [["encrypted_password", "$2a$10$noH1/rWnS5f3N6B7a3jYWOrCWvhZ/LsekT5e5.3VEvK2gbrxWXCTe"], ["gender", "Female"], ["updated_at", "2016-03-29 06:46:29.638920"], ["id", 1]]

  def search_result
    if params[:standard_id] and params[:subject_id]!=nil
      stand_subj = StandardSubject.where(standard_id: params[:standard_id], subject_id: params[:subject_id]).take
      @standard = stand_subj.standard.name
      @subject = stand_subj.subject.sub_name

      stand_subj_id = stand_subj.id
      teacher_assigned = TeacherStandardSubject.find_by(standard_subject_id: stand_subj_id)
---
SELECT  "standard_subjects".* FROM "standard_subjects" WHERE "standard_subjects"."standard_id" = $1 AND "standard_subjects"."subject_id" = $2 LIMIT 1  [["standard_id", 1], ["subject_id", 1]]
SELECT  "teacher_standard_subjects".* FROM "teacher_standard_subjects" WHERE "teacher_standard_subjects"."standard_subject_id" = $1 LIMIT 1  [["standard_subject_id", 1]]

  def set_teacher
    @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1  ORDER BY "teachers"."id" ASC LIMIT 1  [["id", 1]]