app/controllers/tests_controller.rb

SELECT  "tests".* FROM "tests" WHERE "tests"."teacher_id" = $1 LIMIT 5 OFFSET 0  [["teacher_id", 1]]
SELECT COUNT(*) FROM "tests" WHERE "tests"."teacher_id" = $1  [["teacher_id", 1]]
---
  def index
    @tests=current_teacher.tests.where("test_datetime>=?",DateTime.now).paginate(:per_page => 4, :page => params[:page])