app/views/tests/index.html.erb

                      <td><%= count_no_of_questions_remaining(test) %></td>
                      <td><%= test.teacher.first_name %></td>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1  ORDER BY "teachers"."id" ASC LIMIT 1  [["id", 1]]